//-----------------------------------------------------------------
// 程序描述:
//     基于程序延时的不同延时时基的程序：us,ms
// 作    者: 凌智电子
// 开始日期: 2018-08-04
// 完成日期: 2018-08-04
// 当前版本: V1.0
// 历史版本:
//   - V1.0: 基于STM32的延时：us,ms
// 调试工具: 凌智STM32F429+CycloneIV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "delay.h"
#include "FreeRTOS.h"					//FreeRTOS使用	
#include "task.h"
//-----------------------------------------------------------------

static u32 fac_us=0;	// us延时倍乘数
static u16 fac_ms=0;	// ms延时倍乘数,在os下,代表每个节拍的ms数

//-----------------------------------------------------------------
// void SysTick_Handler(void)
//-----------------------------------------------------------------
// 
// 函数功能: SysTick中断服务程序
// 入口参数: u8 SYSCLK：系统时钟频率
// 返 回 值: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void SysTick_Handler(void)
{  
	if(xTaskGetSchedulerState()!=taskSCHEDULER_NOT_STARTED)//系统已经运行
  {
		xPortSysTickHandler();	
  }
	HAL_IncTick();
}

//-----------------------------------------------------------------
// void SysTick_clkconfig(u8 SYSCLK)
//-----------------------------------------------------------------
// 
// 函数功能: SysTick参数配置
// 入口参数: u8 SYSCLK：系统时钟频率
// 返 回 值: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void SysTick_clkconfig(u8 SYSCLK)
{
	u32 reload;
	
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);// SysTick频率为HCLK
	fac_us=SYSCLK;
	
	reload=SYSCLK;					    						// 每秒钟的计数次数 单位为K	   
	reload*=1000000/configTICK_RATE_HZ;		// 根据configTICK_RATE_HZ设定溢出时间
																					// reload为24位寄存器,最大值:16777216,在180M下,约合0.745s左右	
	fac_ms=1000/configTICK_RATE_HZ;				// 代表OS可以延时的最少单位	   
	SysTick->CTRL|=SysTick_CTRL_TICKINT_Msk;// 开启SYSTICK中断
	SysTick->LOAD=reload; 									// 每1/OS_TICKS_PER_SEC秒中断一次	
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk; // 开启SYSTICK
}								    

//-----------------------------------------------------------------
// void delay_us(u32 nus)
//-----------------------------------------------------------------
// 
// 函数功能: SysTick延时us
// 入口参数: u32 nus：要延时的us数.	
// 返 回 值: 无
// 注意事项: nus:0~190887435(最大值即2^32/fac_us@fac_us=22.5)	
//
//-----------------------------------------------------------------
void delay_us(u32 nus)
{		
	u32 ticks;
	u32 told,tnow,tcnt=0;
	u32 reload=SysTick->LOAD;			// LOAD的值	    	 
	ticks=nus*fac_us; 						// 需要的节拍数 
	told=SysTick->VAL;        		// 刚进入时的计数器值
	while(1)
	{
		tnow=SysTick->VAL;	
		if(tnow!=told)
		{	    
			if(tnow<told)				// 这里注意一下SYSTICK是一个递减的计数器就可以了.
				tcnt+=told-tnow;	
			else 
				tcnt+=reload-tnow+told;	    
			told=tnow;
			if(tcnt>=ticks)
				break;						// 时间超过/等于要延迟的时间,则退出.
		}  
	}
}

//-----------------------------------------------------------------
// void delay_ms(u16 nms)
//-----------------------------------------------------------------
// 
// 函数功能: SysTick延时ms
// 入口参数: u32 nms：要延时的ms数
// 返 回 值: 无
// 注意事项: 会引起任务调度
//
//-----------------------------------------------------------------
void delay_ms(u16 nms)
{
	if(xTaskGetSchedulerState()!=taskSCHEDULER_NOT_STARTED)//系统已经运行    
	{		 
		if(nms>=fac_ms)										// 延时的时间大于OS的最少时间周期 
		{ 
			vTaskDelay(nms/fac_ms);	 		//FreeRTOS延时
		}
		nms%=fac_ms;											// OS已经无法提供这么小的延时了,采用普通方式延时    
	}
	delay_us((u32)(nms*1000));	// 普通方式延时
}

//-----------------------------------------------------------------
// void delay_ms_n(u16 nms)
//-----------------------------------------------------------------
// 
// 函数功能: SysTick延时ms
// 入口参数: u32 nms：要延时的ms数
// 返 回 值: 无
// 注意事项: 不会引起任务调度
//
//-----------------------------------------------------------------
void delay_ms_n(u16 nms)
{
	u32 i;
	for(i=0;i<nms;i++)
		delay_us(1000);	// 普通方式延时
}

//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 	 
